{
  "positions": [
    {
      "title": "President",
      "slug": "president",
      "sheet": "President",
      "candidates": [
        {
          "name": "Caridad Estrada",
          "statement": "Over the past year, countless graduate students have expressed a similar frustration: that Graduate Student Government is too often disconnected from the students it is meant to represent. Instead of operating as a collective voice, it has become siloed, opaque, and driven by individual priorities rather than community needs. I am running for President because the GSG must belong to the graduate student body, not to whichever officer happens to hold the gavel.\nIf elected, my foremost commitment is accountability, to you, and to the values of transparency and good governance. I will not treat this role as a platform for personal agendas or self-promotion. I will treat it as a responsibility to elevate the concerns of students across divisions, departments, and identities, and to ensure that board actions reflect what our community collectively expresses.\nWe are entering a new fiscal moment where the old way of doing things simply does not work. “Business as usual” has produced disengagement, discontent, and policies that do not reflect student priorities. To reverse that pattern, I will:\nRedirect money away from internal board perks (executive stipends, private dinners, etc.) toward student-facing resources, including:\n– conference & professional travel support\n– emergency & hardship funds\n– support for student organizations & cultural groups\n– subsidized transit initiatives\nIncrease transparency by implementing:\n– quarterly public budget reviews\n– “Coffee Chats with the President”\n– clear annual reporting on spending and outcomes\nRestructure internal governance through:\n– updated bylaws & spending rules\n– clarified officer responsibilities & authority\n– stronger protections against overreach & unilateral actions\nRebuild collaboration and institutional memory by:\n– coordinating between officers rather than siloing work\n– training incoming board members for continuity\n– engaging constructively with university partners and administrators\nI believe the GSG can be more representative, more transparent, more responsive, and more impactful than it has been over the past two years. But that requires leadership willing to embrace reform, prioritize the collective, and align resources with student needs rather than internal preferences. \nI am running to make the GSG work for students again, and I am ready to lead that change, with you, and for you.",
          "headshot": "assets/headshots/president-caridad-estrada.jpg"
        },
        {
          "name": "Arafet Safdar",
          "statement": "My name is Arafat Safdar and I’m a first-year PhD student at the Department of Near Eastern Studies. I am running for the Graduate Student Government because I want to ensure that the graduate students have a strong and transparent voice representing them in addressing multiple challenges facing our community. \nChief among these is the growing mental health crisis that demands urgent attention. Beyond access to medical and counseling resources, the University must invest in the social and communal infrastructure that promotes student well-being. While the University has spent approximately $300 million in the expansion and renovation of the recently opened Art Museum, graduate students still lack meaningful, shared spaces where they could gather and build a sense of community. Among other things, my top priority will be advocating for an expedited development of dedicated graduate student community spaces. \nAs commendable as the past GSG’s work has been, I believe the body continues to struggle with engagement and visibility among the wider graduate student population. For example, the timing of this year’s nomination and election process - during December/January, when many students are away or preparing for the new semester - highlights a structural problem in how we conduct our democracy. Low turnout and confusion around elections are not signs of disengagement, but of a system that feels remote and confusing for many like me. \nIf elected, I will explore the possibility of constituting a dedicated Outreach Committee (as distinct from Communications) and, if needed, push for a constitutional review process to reassess rules around student participation that no longer reflect the realities of graduate life at Princeton. In my conversations with fellow students, what I have consistently heard is not nonchalant disregard, but confusion about how to get involved in the process through non-Assembly channels.\nWhile I may be relatively new to Princeton, I bring relevant experience from my time at the University of British Columbia-Vancouver, where I worked at the Faculty of Graduate and Postdoctoral Studies for five years - as an executive assistant to the Dean. This role gave me a rare perspective on graduate life from both administrative and student-facing angles. I hope to utilize this experience in contributing meaningfully to the graduate life experience at Princeton.\nI am not running on grand promises. I am running on a commitment to transparency, engagement, and the willingness to initiate honest, sometimes uncomfortable conversations that are long overdue.",
          "headshot": "assets/headshots/president-arafet-safdar.jpg"
        },
        {
          "name": "Jan Ertl",
          "statement": "Jan Ertl, G4 Economics, Candidate for GSG President\nI'm running for GSG President because Princeton graduate students deserve leadership that practices good governance and delivers results. As your current VPIA and former treasurer, I've secured real wins for graduate students: making a ‘Block32’ graduate meal plan option available starting next year, launching a funding initiative that revived or founded 20+ student organizations, processing funding for over 70 events, saving GSG over $100k through careful financial oversight, helping reverse a $300 meal plan increase, championing bus routes to connect grad residences.\nMy platform (non-exhaustive):\nProtecting Graduate Students from Budget Impacts: Princeton departments are implementing 5-10% budget cuts and admitting fewer students. I will advocate to keep stop-gap funding for canceled grants available, and push against higher and inequitable teaching loads without proper compensation. Through CPUC, I will advocate that stipends increase more than the cost of living, and that we do not face implicit cuts through reductions in student services.\nGSG Financial Transparency and No New Fees without Referendum: I will make all GSG expenses public and require pre-approval in assembly. I'll implement biannual budgeting to curtail officer overspending and ensure fiscal responsibility. Amidst rising living costs, any new fees should require a referendum vote by the graduate student body.\nImproved Health and Leave Policies: I will keep advocating for clear medical leave procedures, continued campus access during leave, and streamlined re-enrollment processes.  will push for better health insurance navigation resources so students don't learn the American healthcare system through costly mistakes. Following the GS faculty committee's recent decision on DCE parental leave, I will work to address the cost and timeline concerns that blocked progress and build administrative support for sustainable family policies.\nFighting for International Students amidst Uncertainty: I will keep working to expand CPT eligibility across departments, speed up re-enrollment to smooth visa renewals, vigilantly monitor threats to OPT/H-1B programs that are critical to career pathways, connect students to resources to resolve double taxation issues and push on proper recognition of external fellowships. \nReimagining Community Programming: The cancellation of Wintersession was sorely felt by our community. I want to gauge interest for a smaller-yet-impactful grad-student-led two-week program in January 2027, aiming to foster similar community and engagement at a fraction of the cost. \nI'm committed to leading a disciplined, transparent, and effective GSG that serves all graduate students. I would be honored to serve as your President.",
          "headshot": "assets/headshots/president-jan-ertl.png"
        }
      ]
    },
    {
      "title": "Vice President",
      "slug": "vice-president",
      "sheet": "Vice President",
      "candidates": [
        {
          "name": "Andrea Aude",
          "statement": "Hi! My name is Andrea Aude, I’m a second-year in the Chemical and Biological Engineering (CBE) department, and I am excited to share that I am running for Vice President of the Graduate Student Government (GSG). \n\nGraduate school is an intensive, demanding, uniquely personal journey that challenges us not only intellectually but also mentally, physically, and spiritually. For us to do our best work and be our best selves, we need systems of support that are accessible and actually address the true needs and challenges of our community. \n\nGSG has real power to advocate for graduate students, but after serving as Special Events Officer for the past year and a half, I’ve seen how gaps in coordination, accountability, and communication limit its effectiveness.\n\nAs VP, my goal is to make GSG more collaborative, accountable to, and engaged with the student body so it can consistently deliver meaningful results to improve the graduate student experience.\n\nTerm Priorities\nStructural Reform for More Transparent and Efficient Governance\nRevamp GSG governing documents to clarify quality control mechanisms given lack of accountability procedures\nPromote collaboration and transparency over siloed operations by establishing clear internal decision-making procedures and expectations for communication\n\nExpand and Operationalize Democratic Participation\nConduct Assembly meetings as forums for co-governance, where Assembly members actively participate in deliberation and decision-making rather than receive tailored progress updates and give procedural approvals\nImprove cohesion between the Executive Board, Assembly, and students by standardizing Assembly member onboarding and equipping Assembly members with communication tools to engage with and collect feedback from their constituencies\n\nImprove Quality of Life and Professional Development\nAdvance initiatives addressing access to off-campus housing, roommate matching, food security, as well as navigating professional relationships and development\nAdvocate for student-centered responses to emerging issues, including AI in teaching and learning as well as funding and award constraints\nCoordinate social development of cross-department and interdisciplinary networks\n\nIf this vision resonates with you, I would be honored to have your vote.\n\nMy promise to you is that I will listen. I will follow through. \nAnd I will advocate relentlessly on your behalf. \nTogether, we can build a better Princeton—and GSG—for tomorrow with your vote today.\nVote for the change you want to see at Princeton and within GSG: vote for Andrea.",
          "headshot": "assets/headshots/vice-president-andrea-aude.jpg"
        },
        {
          "name": "Zoe Gorman",
          "statement": "I’m Zoë, a fifth year Ph.D. candidate in security studies at SPIA. I call Stockholm and New York hometowns, and my research focuses on developing quantitative models to analyze armed conflict. In addition to serving as GSG Secretary this year, I have worked for the European Union and the United Nations. I also love rock climbing, classical music and running with my rescue husky, Kofi!\n\nI am running for Vice President because Princeton graduate life is at a critical juncture, and I want to work together to turn good ideas into tangible progress — through strong governance, initiative and resilience:\n\n1. Governance.\n\n• Upholding the GSG Constitution and bylaws and making transparent, consensus-based amendments through appropriate channels. \n\n• Tapping new sources of sustainable funding from alumni networks and voluntary donations without student fees. \n\n• Engaging with all departments at Assembly and CPUC, bolstering committee structures and garnering feedback from students (personal and electronic) at every stage of policymaking. \n\n2. Initiative.\n\n• Expanding public transportation subsidies for travel to New York, D.C. and Philly, as part of the transport sustainability initiative.\n\n• Instituting a town hall bringing mental health concerns to the administration for concrete improvements to academic and community life. \n\n3. Resilience.\n\n• Advocating for clarity over funding and precepting obligations in light of budget cuts and increased rights for DCE status students.\n\n• Providing centralized visa support, with department liaisons, for international students.\n\n• Cutting budgets does not mean cutting community. Delivering quality, cost-effective GSG events and supporting student organizations through Events Board.\n\nAs Secretary, I recorded and disseminated minutes for GSG executive and Assembly meetings and managed press outreach. I proposed a sustainability transportation initiative that will encourage public transit via major subsidies for NJ Transit and Amtrak. I launched a Mental Health Ideathon and shared anonymous suggestions with senior University administration. I collaborated with board members and the University to strategize a location for the Graduate Student Center and to promote a quarter meal plan, debuting next fall — all without spending a dime of GSG funds.\n\nAs VP, I will commit to transparency, fight for the priorities of graduate students and uphold the Constitution. Streamlining engagement with the Graduate School and University will chart a clear, centralized process for proposing, discussing, voting for and realizing change. I loved my time on GSG and am proud of this community. I hope to earn your trust as VP and to empower each other with positivity, vigour and respect.",
          "headshot": "assets/headshots/vice-president-zoe-gorman.jpg"
        }
      ]
    },
    {
      "title": "Treasurer",
      "slug": "treasurer",
      "sheet": "Treasurer",
      "candidates": [
        {
          "name": "Varun Sivashankar",
          "statement": "My name is Varun, and I am a G3 PhD student in Applied Mathematics. I am running for Treasurer because I care deeply about ensuring that our limited resources are used transparently and responsibly for the broad benefit of the graduate student community.\n\nThe Princeton GSG operates with a relatively small budget compared to peer institutions but it has used those funds effectively by supporting student organization events, distributing grad sweaters and providing Procter Hall meals. If elected, I intend to continue this tradition of doing more with less. My core priorities are as follows:\n\n1. Increased transparency: Many graduate students are unaware of what the GSG fee is or how exactly their approximately $30 contribution is spent. At the end of every semester, I commit to providing a clear and detailed breakdown of how GSG funds are allocated across events and initiatives, along with accessible explanations of the financial constraints involved in budgeting decisions.\n\nIn addition, student organizations should be able to clearly understand how funding decisions are made. I will work to improve clarity around allocation criteria so that organizations of different sizes and missions have equitable access to resources.\n\n2. Responsible growth of the GSG budget: Building on last year’s work in expanding Graduate School support, I will advocate for continued increases in contributions from the Graduate School and the Office of Campus Life. At the same time, I will explore alternate funding sources from alumni and external partnerships so that we don't have to worry about higher student fees.\n\n3. Increased community involvement: While the GSG strives to allocate funds responsibly, graduate students should have meaningful opportunities to offer feedback. This includes proposing new initiatives for funding as well as voicing concerns about existing ones. I will make an honest effort to incorporate community input into budget planning and ensure that student perspectives are actively considered.\n\nFinally, as a math student, you can trust me to count your money. But right now, I’m counting on your support. Thank you for considering my candidacy!",
          "headshot": "assets/headshots/treasurer-varun-sivashankar.jpg"
        },
        {
          "name": "Yongqi Wang",
          "statement": "I am running for Treasurer of the Princeton Graduate Student Government because I bring hands-on experience with budgeting, revenue generation, and student-focused financial decision-making, and I want to ensure that GSG funds are allocated transparently, equitably, and in direct response to graduate student needs.\nAs an undergraduate, I served as Head of the Outreach Department in student government. Our department was uniquely responsible for generating revenue through external sponsorships, rather than solely distributing existing funds. In that role, I managed budgets for large-scale events such as formals and holiday ceremonies, balancing sponsorship income against event costs while ensuring financial accountability. This experience taught me how proactive financial planning can expand programming without increasing the burden on students.\nAt Princeton, I served as Social Chair for the Princeton Neuroscience Institute, where I organized weekly departmental social hours over the course of a full year. My responsibilities included budgeting, ordering food and beverages, coordinating deliveries, advertising events, and managing post-event logistics. Running recurring events under a fixed budget required careful cost control and consistency, ensuring strong attendance while remaining fiscally responsible.\nIn my research lab, before we had a dedicated lab manager, I was deeply involved in equipment purchasing and travel reimbursements, giving me practical familiarity with Princeton’s Concur system and the end-to-end finance workflow. This experience positions me to help student groups navigate funding processes efficiently and avoid common bottlenecks.\nAs an international student, I am particularly committed to equitable budgeting across cultural backgrounds. This could include supporting events tied to international and cultural holidays—such as Lunar New Year, Diwali, Eid, or Nowruz—so that all students feel represented in GSG-funded programming.\nFinally, I am active in the GSG Slack community, which I view as a critical listening tool. As Treasurer, I would formalize this feedback loop through regular virtual office hours, clear funding updates, and open discussion of spending priorities. My goal is to ensure that GSG budgeting reflects the voices, values, and lived experiences of our graduate students.",
          "headshot": "assets/headshots/treasurer-yongqi-wang.jpg"
        }
      ]
    },
    {
      "title": "Vice President of Internal Affairs",
      "slug": "vice-president-of-internal-affairs",
      "sheet": "Vice President of Internal Affa",
      "candidates": [
        {
          "name": "Anastasia Dressel",
          "statement": "Hello! My name is Stacie Dressel, and I am excited to be running for Vice President of Internal Affairs (VPIA). I am currently a G2 in Chemical and Biological Engineering and have served as Social Chair during the 2025 term. I believe that although the VPIA role is a more inward-facing role, the overall focus of the individual serving should be outward towards the graduate student body. My involvement in the executive board and being in a role that is focused on creating a meaningful and enjoyable experience for Princeton makes me an excellent candidate.  \n\nAs Social Chair, I did not just host happy hours, but sought to provide a variety of experiences to resonate with graduate students from many backgrounds. Throughout the year, there were an assortment of drinks and snacks as well as different activities to help people participate and bond. Themes for social events included Lego nights, bingo nights, make your own crepes, and plant giveaways. My efforts in this position reflect a leadership style that is intentional, inclusive, and people-centered as I tried to create spaces where community forms organically and where individuals feel welcomed, seen, and engaged. Through this experience I also coordinated several people who helped run each happy hour and thoughtfully managed a large budget. As VPIA I would seek to help future GSGmembers with future GSG events as well as continue this leadership approach with the board. \n\nOver the past year, I felt like the GSG executive board has taken on a wide variety of tasks that have addressed constructive goals. At the same time, the extent of the projects have made it difficult for members to work together or feel that they received appropriate support. As VPIA I would like to encourage more coordination of goals between board members as well as collaboration and support in the form of helping plan, set up, clean up, or just attend GSG events. Teamwork makes the dream work! \n\nI would also like to use this role to provide a consistent source of gentle accountability for GSGboard members. Making sure that the GSG executive team accomplishes what we promise is incredibly important for building trust with the student body. Accountability also means that I will seek to help the initiatives of board members align with the needs of the graduate student body and follow the constitution. \n\nSuccess for the GSG executive board means that steps are taken to improve the lives of Princeton graduate students. As VPIA, I would be honored to help advance that mission.\n\nBest,\n\nStacie Dressel",
          "headshot": "assets/headshots/vice-president-of-internal-affairs-anastasia-dressel.jpg"
        },
        {
          "name": "Nivedita (Niv)  Kanrar",
          "statement": "Hello everyone! I'm Niv, a G3 in Quantitative and Computational Biology, and I am excited to run for GSG Vice President of Internal Affairs (VPIA).\nI care deeply about the well-being of my peers, a commitment I have demonstrated through both grassroots and formal initiatives at Princeton. My advocacy began early in my time at Princeton, when I co-wrote a petition highlighting the unique challenges faced by students residing in Walker Hall during its first year of graduate occupancy (2023-24).\nThis experience led me to more formal service: in my second year, I was appointed by the Graduate School to the inaugural Graduate Student Committee, giving an independent panel of students a seat in administrative decision-making. As a voting member of the Student Life & Discipline Subcommittee, I contributed to decisions on critical academic cases, building strong working relationships with the graduate school administration and ensuring student voices were effectively represented. This role gave me insight into the priorities of the graduate school, but it also emphasized to me the need for direct student representation through the GSG.\nI hope my past service can speak for itself and show the commitment and dedication I will bring to the position of VPIA if I am elected. I am committed to strengthening the GSG’s support for the student body, ensuring transparency, and building an effective and accountable graduate student government. If elected, I will continue to advocate for graduate students, listening carefully to concerns and working to enact meaningful improvements.",
          "headshot": "assets/headshots/vice-president-of-internal-affairs-nivedita-niv-kanrar.jpg"
        }
      ]
    },
    {
      "title": "Special Events Officer",
      "slug": "special-events-officer",
      "sheet": "Special Events Officer",
      "candidates": [
        {
          "name": "Kaiwen Zhang",
          "statement": "Hi everyone,\nMy name is Kevin Zhang, and I am running to become your next Special Events Officer! I am currently a G4 in ORFE, and before coming to Princeton, I studied in Zürich and Frankfurt.\nLife in Princeton should be more than just work, and as your future Special Events Officer, I will guarantee that there will be enough going on to balance the otherwise hectic graduate student life. As someone who rarely says no to a good time, I have thoroughly enjoyed the GSG parties and events offered throughout my time at Princeton so far. I believe these social events play an integral role in bringing our community together and allowing us to bond over shared experiences.\nOrganizing events and bringing people together have always been important to me. During my undergraduate years, I served as a student organization representative for up to 200 students. Through this, I gathered plenty of experience in large event planning that helped me to continue my involvement here in Princeton. As a former member of the GCHC Social Hour team, I helped ensure that the weekly events ran smoothly, and had a great time letting my creativity run wild while bartending:D. As a co-chair of the Princeton German Society, I work closely with Jan to organize numerous events that bring people together to share new experiences.\nThemed GSG parties are a treasured graduate student tradition that I am eager to continue. I have also welcomed the added variety in recent years, such as Wine and Cheese or the Battle of the Bands, to showcase graduate student talent. As a large and diverse graduate student body, we can benefit from a wide range of social events. I'm committed to experimenting with new themes, venues, and event formats to find what resonates — while keeping the beloved traditions that already bring us together. It is particularly important to me to work together with the community, and I would love to hear about your ideas and wishes!\nI would be thrilled to get next year’s parties running for you guys as your new Special Events Officer. Thank you very much for your consideration!",
          "headshot": "assets/headshots/special-events-officer-kaiwen-zhang.jpg"
        },
        {
          "name": "Mingkun Zhao",
          "statement": "My name is Mingkun Zhao, and I am a fourth-year graduate student from the ECE\ndepartment. I have a strong interest in community building, student well-being, and inclu-\nsive social engagement. I am excited to apply for the Special Events Officer position in the\nGraduate Student Government, as I deeply value the role that thoughtfully planned social\nevents play in fostering connection, balance, and belonging within the graduate community.\nDuring my time at Princeton, I have actively served both the graduate student body\nand the broader community through leadership, service, and event organization. I currently\nserve as the Chair of the Princeton Zen Club, where I organize and lead meditation sessions\nthat support students’ mental health and stress management throughout the academic year.\nI also contribute to wellness-focused activities through my involvement with the Princeton\nYoga Club. During Wintersession 2025, I organized a classical guitar concert, coordinating\nperformers and logistics to create a welcoming cultural event for students.\nBeyond campus, I volunteer as a hospice volunteer at Penn Medicine, and I am also a\nseeing-eye puppy raiser for a service dog organization, helping train future assistance dogs\nfor individuals with disabilities. Together, these roles have strengthened my skills in coor-\ndination, communication, empathy, and teamwork, while reinforcing my commitment to\nservice-oriented leadership.\nI have a strong interest in organizing large-scale social events that are inclusive, well-\ncoordinated, and responsive to the diverse needs of graduate students. As Special Events\nOfficer, I would enjoy overseeing major social events, collaborating with the Treasurer and\nofficers to support budgeting and logistics. My goal is to help create engaging events that\nfoster community across departments, support student well-being, and provide opportu-\nnities for graduate students to connect beyond their academic work. I am excited about\nthe opportunity to contribute my experience, creativity, and dedication to strengthening\ngraduate life through meaningful shared experiences.",
          "headshot": "assets/headshots/special-events-officer-mingkun-zhao.jpg"
        }
      ]
    },
    {
      "title": "Academic Affairs Officer",
      "slug": "academic-affairs-officer",
      "sheet": "Academic Affairs Officer",
      "candidates": [
        {
          "name": "Poorya Mollahosseini",
          "statement": "Fellow Graduate Students,\nI am running for Academic Affairs Officer because I have observed recurring inefficiencies in our academic systems. While my perspective is rooted in the ECE department, conversations with peers across the university have convinced me that administrative friction is a systemic issue. Whether you work in a lab, an archive, or a library, I have seen how much unnecessary stress is generated by the mechanics of our degree programs regardless of the field.\nCurrently, core academic functions, from establishing effective communication with advisors to navigating the general examination, often act as sources of friction rather than support. Too many students lose valuable time and mental energy trying to decode unclear requirements or managing interpersonal misalignments.\nMy platform is straightforward: Academic processes should be seamless and transparent so that students can focus on what really matters: the research.\nIf elected, I will focus my advocacy on two key areas:\n1. Advisor-Student Dynamics The relationship with an advisor is the single biggest factor in a PhD student’s success, yet it currently lacks sufficient structure. I intend to advocate for:\n• Feedback Standards: Establishing norms to prevent common pitfalls such as lack of timely feedback or, conversely, counterproductive micromanagement.\n• Expectation Alignment: Encouraging standardized \"advising agreements\" early in the process to align expectations regarding work hours and milestones.\n• A Clear Grievance Process: ensuring there is a transparent, neutral pathway to resolve conflicts when the advisor-student relationship breaks down, without fear of professional repercussions.\n2. Administrative Efficiency Administrative hurdles should not require detective work. I aim to streamline the \"business\" side of the PhD by:\n• Clarifying Milestones: Removing ambiguity around General Exam requirements and defense scheduling.\n• Centralizing Information: Ensuring that degree requirements are explicit and accessible, minimizing the administrative overhead for every student.\nWe are here to solve complex problems in our respective fields. We should not have to struggle with the structure of the program itself. I ask for your vote to help clear the path, allowing us all to dedicate our full attention to our work.",
          "headshot": "assets/headshots/academic-affairs-officer-poorya-mollahosseini.jpg"
        },
        {
          "name": "Carla Crucianelli",
          "statement": "Hello everyone! I’m Carla, I am a fourth-year PhD candidate in\nthe department of Operations Reseach and Financial\nEngineering (ORFE) currently working in stochastic analysis and\nmean field games and I am excited to be running for the position\nof Academic Affairs Officer!\nAs graduate students we lie on the line between being students\nand workers. I believe that it is important to advocate for our\nrights in both positions and I will do my best to ensure that every\ngraduate student has a smooth path through their studies and\nenough opportunities while at Princeton to succeed after\ngraduation. This is why I plan on working with other officers at\nGSG and with offices on campus to advocate for consistent (and affordable) on-campus housing\nand reliable transportation.\nIf elected as Academic Affairs Officer, I will also continue with current ongoing initiatives like the\nDisertation Completion Coffee Hours, working to expand CPT/OPT opportunities for more\ndepartments and helping students to navigate and solve advisor-advisee tensions. Further, I\nbelieve that work-life balance and mental health are key elements for academic success, this is\nwhy I will also work with other officers to create initiatives to increase awareness about self-care\nand organize events to increase the sense of belonging to the Princeton community.\nFinally, I want students to be listened and to have a place where they can express any concern\nor issue they might be facing. I believe that since we all come from different backgrounds and all\nacademic departments are different it is important for this role to keep communication open with\nevery student to be able to advocate for everyone. With this goal, I will plan coffee chats for\nstudents to be able to talk about their concerns, discuss what can be done to solve it and plan\nand implement solutions.\nThanks for your consideration and for taking the time to read and vote!",
          "headshot": "assets/headshots/academic-affairs-officer-carla-crucianelli.png"
        }
      ]
    },
    {
      "title": "Facilities Officer",
      "slug": "facilities-officer",
      "sheet": "Facilities Officer",
      "candidates": [
        {
          "name": "Noah Zahn",
          "statement": "Hello all, my name is Noah Zahn and I’m excited to be nominated for Facilities Officer on the GSG executive board. I’m a first-year PhD student in the Department of Chemical and Biological Engineering, and I completed my undergrad at Johns Hopkins in Baltimore. \n \nI am drawn to the GSG executive board because I am passionate about engaging with and advocating for the graduate student body. I hope to support all graduate students in conducting their studies as effectively as possible, and I believe serving as Facilities Officer is the most impactful way for me to contribute to this goal.\n \nAs graduate students at Princeton, we face many stresses each day, so broken laundry machines and malfunctioning toilets should not have to be one of these stresses. I seek to enable graduate students to focus on their work and well-being by reducing the nuisances of daily life and making graduate living as headache-free as possible.\n \nMy prior experiences managing maintenance contracts for laboratory equipment while working at a national lab, as well as serving as the housing chair for my fraternity, has prepared me to address the housing, dining, and transportation concerns faced by graduate students. Additionally, my time as president of the Interfraternity Council (IFC) in undergrad exposed me to the complexities of student leadership and institutional bureaucracy, equipping me to navigate and advocate effectively on behalf of graduate students. I plan to take a proactive approach to this role by identifying and addressing facilities and transportation issues before they become a larger problem.\n \nI care deeply about the day-to-day experiences of graduate students and want to ensure that our living and working environments reflect that care. I would be grateful for the opportunity to serve as Facilities Officer and to be a reliable advocate for the graduate community.",
          "headshot": "assets/headshots/facilities-officer-noah-zahn.jpg"
        },
        {
          "name": "Efran Hosseini",
          "statement": "I am seeking this role to advocate for graduate student concerns related to housing, dining, trans-\nportation, and campus accommodations. In particular, many graduate students have expressed\nconcern regarding the availability of new and sufficient housing. While I recognize that large-\nscale facilities planning involves complex institutional processes, I believe that the consistent and\norganized communication of student perspectives is essential to informed decision-making.\nIf elected, I will prioritize serving as a bridge between graduate students and the relevant University\ndepartments and advisory bodies, including the Graduate Housing Advisory Board, the Housing\nPolicy Group, and the Transportation Advisory Board. My goal is to ensure that student concerns\nare accurately conveyed, thoughtfully discussed, and clearly followed up on. I am committed to\nlistening carefully to student feedback and representing those views professionally and responsibly.\nI have also heard concerns regarding recent reductions in the frequency and operating hours of on-\ncampus transportation, as well as cuts to on-demand transportation services. While I understand\nthat these changes may be driven by budgetary constraints, I believe that improved communication\nbetween the student community and University departments can help optimize transportation\nschedules and related services. These examples represent only some of the many facilities-related\nissues where regular dialogue and feedback can support more effective and responsive planning.\nBeyond housing and transportation, I aim to support graduate students by advocating for accessible\ndining options and inclusive campus accommodations. I will approach this role with professionalism,\nrespect for University policies, and a commitment to transparent communication.\nThank you for your time and consideration. I appreciate the opportunity to participate in the Grad-\nuate Student Government election process and to contribute to the graduate student community\nat Princeton University.",
          "headshot": "assets/headshots/facilities-officer-efran-hosseini.jpg"
        },
        {
          "name": "Pao Engelbrech",
          "statement": "Studying politics, I have learned again and again that the way in which groups organize themselves is crucial for resisting injustices and making their voices heard. Becoming part of the Graduate Student Government is an ideal way for me to help facilitating the self-organization of our graduate students community, which I consider to be a very meaningful task.\n\nAs Facilities Officer, I would like to work on this task by listening to students' concerns, and supporting you wherever needed when it comes to housing, transportation, and dining. In addition, in this role, I do not only want to coordinate on a regular basis with relevant student bodies and administrators, but also emphasize the inclusion of facilities staff representatives on campus into debates and new initiatives – i.e. the perspectives of those who make our lives in Princeton possible in the first place.\n\nThroughout and beyond day-to-day discussions, I plan to push in particular three longer-term demands in our interest: \n\nconnecting housing with mental health – make free flats available to students who need them!\nimproving the conditions for cycling on and around campus – some roads are dangerous!\nlinking price increases to stipend increases – don't make life more expensive for grad students!\n\nAlready during my undergraduate studies, I have led a successful student initiative for the reform of the economics curriculum at the University of Manchester. In this role, as in subsequent jobs – including at the Federation of German Trade Unions – I have been a bridge between different groups within a larger team. This ability to bring people together and get along with very different characters is what I also want to contribute to the Princeton GSG – with the goal of making our united voices as graduate students heard on campus and in the Graduate School!",
          "headshot": "assets/headshots/facilities-officer-pao-engelbrech.jpg"
        }
      ]
    },
    {
      "title": "Health and Life Officer",
      "slug": "health-and-life-officer",
      "sheet": "Health and Life Officer",
      "candidates": [
        {
          "name": "Ananya Chakravarti",
          "statement": "My name is Ananya Chakravarti, and I am a fourth-year joint PhD candidate in Chemical & Biological Engineering and Materials Science. I am excited to run for re-election as Health & Life Officer!\n\nOver the past several years, I have navigated significant health challenges while balancing the demands of a high-pressure academic environment. Experiencing firsthand how difficult it can be to access effective care and accommodations shaped my commitment to student wellness and equity. These experiences motivate my work to make health and wellness more accessible, inclusive, and community-driven for graduate students.\n\nThis year, as GSG Health & Life Officer, I focused on building visible, engaging, and sustainable wellness programming that address my four key pillars of health: physical, mental, emotional, spiritual. I organized a wide range of events, including Women’s History Month Puppy Yoga, wellness candle-making, DIY trail mix and energy bites, crafts workshops, Día de los Muertos card-making, “Take a Card, Leave a Card” peer encouragement initiatives, holiday cards for troops overseas, student health insurance presentation, and the restart of the Graduate Buddy Program.\n\nDuring a year with budget challenges, I secured external funding from TigerWell, OCE, and VPCL and carefully monitored the Health & Life budget to ensure responsible spending and long-term sustainability. In addition, I served on the TigerWell Grants Advisory Committee, Student Health Plan Advisory Committee, and PUL mental health task force, and collaborated with University Health Services, Graduate Life, and campus leadership to ensure student voices informed health programming.\n\nLooking ahead, I aim to expand culturally inclusive wellness initiatives by collaborating with affinity groups on themed events such as cooking sessions or seed cycling workshops. As a certified yoga/meditation facilitator, I plan to launch fun weekly wellness challenges that foster consistency, connection, and community. I also plan to collaborate with campus partners to organize an on-campus blood draw and health screenings to reduce barriers to preventative care.\n\nAdvocacy will remain central to my role. After nearly having my own medical accommodations denied when I entered graduate school, I am committed to strengthening health accommodations, improving student insurance access, expanding availability of menstrual products, and lowering barriers to outpatient care. I will continue gathering student feedback and working across GSG to ensure all events are inclusive of health needs.\n\nI would be honored to continue serving as your GSG Health & Life Officer and building a healthier, more connected graduate community together.",
          "headshot": "assets/headshots/health-and-life-officer-ananya-chakravarti.jpg"
        },
        {
          "name": "Hantao Wu",
          "statement": "My name is Hantao Wu, and I’m a PhD student at Princeton studying population, social policy, and economics. I’m running for Health and Life Officer because—like many of you—I’ve learned the hard way that graduate school is not just about research productivity, but also about staying healthy, supported, and sane along the way.\n\nOver the past few years, I’ve experienced graduate life from many angles: juggling coursework, research deadlines, teaching, conference travel, and the everyday ups and downs that come with being far from home. These experiences have made me especially aware of how mental health resources, healthcare access, work-life balance, and a sense of community shape our graduate experience far more than we often admit.\n\nIf elected, my priority as Health and Life Officer would be to make support more visible, more accessible, and more responsive to real graduate student needs. This includes working closely with University Health Services and CPS to improve clarity around appointments and coverage, advocating for better communication about existing resources (many of which are underused simply because they’re hard to find), and supporting initiatives that reduce isolation—especially for international students, first-generation students, and those navigating particularly demanding stages of their programs.\n\nI also care deeply about creating low-stakes, welcoming spaces where graduate students can connect beyond their departments. Sometimes what we need most isn’t another policy change, but a reminder that we’re not alone—and that it’s okay to ask for help.\n\nOutside of research, I enjoy teaching, data projects, and long conversations over coffee about anything from labor economics to where to find the best dumplings near campus. I’d be honored to serve the graduate community in this role and to work collaboratively with fellow GSG members to make Princeton a healthier, kinder place to do graduate work.\n\nThank you for your time and consideration.\n\nWarmly,\nHantao Wu",
          "headshot": "assets/headshots/health-and-life-officer-hantao-wu.jpg"
        }
      ]
    },
    {
      "title": "International Student Affairs Officer",
      "slug": "international-student-affairs-officer",
      "sheet": "International Student Affairs O",
      "candidates": [
        {
          "name": "Clara Blanco",
          "statement": "Hi everyone! I’m Clara and I'm running because I genuinely believe we can make Princeton\nbetter for all grads. Over the past few years, I’ve learned that graduate life is not just classes\nand research. It’s also about community, transparency, and feeling that someone has your\nback when things get complicated.\nAs an international student doing my PhD in engineering here, I know very well what it\nmeans to arrive in the U.S. from abroad: the paperwork, the visa questions, the cultural\ndifferences and that overwhelming feeling at the beginning (and sometimes well after the\nbeginning too). If elected as International Student Affairs Officer, my main goal will be to\nstrengthen support for international grads and make sure nobody is left without clear and\naccessible information.\nI want to help make things easier. I would love to work closely with the Davis International\nCenter to improve how information about CPT and OPT reaches students; with more\npractical guides, and clearer timelines. I also would like to push for more opportunities where\ninternational (and domestic) students mix naturally; because integration should feel simple\nand welcoming (now more than ever)!\nOutside the lab I spend my time running, playing tennis, and doing karaoke (no worries, I\nwon’t be singing at GSG meetings). Strava has taught me that many grads run on coffee and\nmotivation, and that we all appreciate a few extra kudos. I’d bring that same positive,\napproachable mindset to the GSG, and try to turn good ideas into actions that actually help\nstudents and are worth giving kudos for.\nIf you give me your vote, I promise to be very approachable, transparent and to represent\nyou the way I would like to be represented!",
          "headshot": "assets/headshots/international-student-affairs-officer-clara-blanco.jpg"
        },
        {
          "name": "Marti Vives",
          "statement": "Dear Graduate Student Community,\n\nMy name is Marti and I am writing to announce my candidacy for International Student Affairs Officer. I will keep my statement brief and focus on two priorities.\n\nI am a G3 PhD candidate in ECE from Spain and have navigated the F1 OPT and STEM OPT process with the Davis IC extensively as I also did my Undergraduate degree at Princeton and worked post graduation. Navigating the current turbulent immigration landscape is not easy, especially as the Davis IC cannot provide immigration advice beyond the current F1/J1 visa landscape, and many miss out on helpful pathways to achieve visa security post graduation. With that in mind here are my priorities:\n\nFree Immigration Attorney Consultations: I will advocate for the Davis IC to start a pilot program offering free immigration attorney consultations. This would be the most useful resource available to international students to obtain specific case-by-case information about their personal situation and about visa opportunities after the F1/J1.\n\nStreamlined CPT/OPT process through the Davis IC: Improve and expand the CPT/OPT application process by having the relevant information more broadly available and shared at the academic department level, where the relevant authorizations and administration burden is usually slowest.\n\nI will prioritize practical solutions and gather feedback through surveys throughout the year to gauge what concerns need to be addressed as the immigration landscape evolves. Finally I will build on the excellent community building initiatives from the past like the Eurovision Night. I hope to earn your vote!",
          "headshot": "assets/headshots/international-student-affairs-officer-marti-vives.jpg"
        },
        {
          "name": "Viola Chen",
          "statement": "My name is Viola, and I am a third-year PhD student in Computer Science researching computational biology. I am running for International Student Affairs Officer because I care deeply about improving the everyday experience of international graduate students at Princeton.\nI have studied and lived across China, Singapore, and the United States, and like many international students at Princeton, I have navigated multiple academic systems, cultural expectations, and institutional structures. These experiences have shaped how I approach communication and advocacy. I understand that challenges faced by international students are often not isolated issues, but the result of overlapping pressures related to immigration status, academic expectations, cultural adjustment, and access to information and support.\nEspecially during periods of uncertainty and transition, international students often carry additional layers of stress while continuing to meet the demands of graduate life. I want to be part of a community that looks out for one another and ensures that no one feels they have to navigate these challenges alone. For me, serving in this role is about showing up consistently, listening carefully, and helping sustain a sense of stability and mutual support within the international student community.\nAt Princeton, I have seen how timely communication and clear guidance can significantly reduce stress and uncertainty, and how the absence of these can leave students feeling isolated or overlooked. I have personally benefited from, and volunteered at, the annual Garage Giveaway, a free furniture and household item distribution that supports incoming and transitioning international students and scholars. Participating in this initiative has shown me the importance of practical, community-driven support and how small, well-organized efforts can make a meaningful difference during periods of transition.\nAs International Student Affairs Officer, I hope to build on this perspective by serving as a reliable bridge between international graduate students, the Graduate Student Government, and the Davis International Center. I am interested in strengthening coordination, improving the accessibility of information and resources, and supporting initiatives that address both immediate needs and longer-term challenges faced by international students.\nI believe effective representation requires careful listening, transparency, and follow-through. I am committed to engaging with international students across departments, accurately conveying their concerns, and working collaboratively to translate feedback into practical improvements. I would be honored to serve the international graduate student community in this role.",
          "headshot": "assets/headshots/international-student-affairs-officer-viola-chen.jpg"
        },
        {
          "name": "Lynn Hirose",
          "statement": "My name is Lynn Hirose, a G4 in Atmospheric and Oceanic Sciences.\n\nAs an international student, the welcoming community at Princeton helped me feel at home during a major transition. Now that Princeton feels like my second home, I would like to give back by supporting other international students as they build belonging, confidence, and connection. I am motivated to support international students’ academic, cultural, and social integration, drawing on both lived experience and hands-on student support roles.\n\nRelevant Experience\n\nMcGraw-affiliated Graduate Peer Coach\nTrained in active listening and one-on-one support, I work with graduate students on a wide range of concerns—from academic challenges to personal and cultural adjustment. As an international student myself, I relate closely to those navigating cultural differences, imposter syndrome, or isolation, and I aim to support graduate students broadly, not limited to international students.\n\nCommunity & Event Building\nAs a Princeton University Concerts Student Ambassador, over three years, I have organized student-focused events such as a Chopin piano competition watch party, a concert intermission social, and a post-concert hot chocolate night. These events were designed to create welcoming spaces where students can connect through music.\n\nMentoring & Cross-Cultural Support\nI mentor multiple students both within and outside Princeton. Through these experiences, I have gained practical insight into supporting students across cultural and institutional contexts.\n\nWhat I Hope to Do in This Role\n\nAs International Student Affairs Officer, I hope to:\n\nPropose inclusive initiatives that support international graduate students’ academic and social well-being\n\nServe as a bridge between international students and campus resources, including the Davis International Center\n\nGather student input to ensure programming reflects community needs and interests\n\nFoster a community where international students feel supported and connected\n\nI would be glad to contribute my experience, empathy, and organizational skills to strengthening Princeton’s international graduate student community.",
          "headshot": "assets/headshots/international-student-affairs-officer-lynn-hirose.jpg"
        }
      ]
    },
    {
      "title": "Social Officer",
      "slug": "social-officer",
      "sheet": "Social Officer",
      "candidates": [
        {
          "name": "Robel Geda",
          "statement": "Fellow Graduate Students,\nI am running for Academic Affairs Officer because I have observed recurring inefficiencies in our academic systems. While my perspective is rooted in the ECE department, conversations with peers across the university have convinced me that administrative friction is a systemic issue. Whether you work in a lab, an archive, or a library, I have seen how much unnecessary stress is generated by the mechanics of our degree programs regardless of the field.\nCurrently, core academic functions, from establishing effective communication with advisors to navigating the general examination, often act as sources of friction rather than support. Too many students lose valuable time and mental energy trying to decode unclear requirements or managing interpersonal misalignments.\nMy platform is straightforward: Academic processes should be seamless and transparent so that students can focus on what really matters: the research.\nIf elected, I will focus my advocacy on two key areas:\n1. Advisor-Student Dynamics The relationship with an advisor is the single biggest factor in a PhD student’s success, yet it currently lacks sufficient structure. I intend to advocate for:\n• Feedback Standards: Establishing norms to prevent common pitfalls such as lack of timely feedback or, conversely, counterproductive micromanagement.\n• Expectation Alignment: Encouraging standardized \"advising agreements\" early in the process to align expectations regarding work hours and milestones.\n• A Clear Grievance Process: ensuring there is a transparent, neutral pathway to resolve conflicts when the advisor-student relationship breaks down, without fear of professional repercussions.\n2. Administrative Efficiency Administrative hurdles should not require detective work. I aim to streamline the \"business\" side of the PhD by:\n• Clarifying Milestones: Removing ambiguity around General Exam requirements and defense scheduling.\n• Centralizing Information: Ensuring that degree requirements are explicit and accessible, minimizing the administrative overhead for every student.\nWe are here to solve complex problems in our respective fields. We should not have to struggle with the structure of the program itself. I ask for your vote to help clear the path, allowing us all to dedicate our full attention to our work.",
          "headshot": "assets/headshots/social-officer-robel-geda.jpg"
        }
      ]
    },
    {
      "title": "DEI Officer",
      "slug": "dei-officer",
      "sheet": "DEI Officer",
      "candidates": [
        {
          "name": "Yassine Ait Ali",
          "statement": "Who am I?\n\n\nGreetings everyone! First, I’d like to thank the several people who nominated me and who—based on my institutional recognition, multi-year experience, and solid background in student affairs at Princeton—believe I will be the right DEI Chair for the whole community of graduate students.\n\nI’m Yassine, a G6 in the French & Italian Department working on the networks of Black intellectuals, artists, and journalists from Africa, the Caribbean, and Harlem in pre-1960 Europe. My particular focus regards the notion of homecoming—or how Black writers and filmmakers conceptualized home, nostalgia, and belonging in times of great displacements.\n\nWhy DEI?\n\nAs a first-generation, low-income student whose parents always dreamt of returning home after they left North Africa for a better future in the 1970s—hence my dissertation topic, I’m particularly aware of the importance of studying and living in an environment that promotes belonging for every single person on campus, regardless of their background. \n\nStudents come to Princeton with various aspirations, needs, and objectives and it has always been (and it will continue to be) my role to make sure that each fellow graduate student feels comfortable in every aspect of their education at Princeton, including their department, labs and offices, housing, and on campus more generally. \n\nMy engagement (i.e. 100+ events on campus since 2020) has been crowned with the Best of Access & Diversity Award I received in May 2023 from the Graduate School.\n\nWhat have I done so far?\n\nGSG Communications Director (since Fall 2024): Redesigned the GSG newsletter to increase student engagement and make it a valuable communication tool for the graduate community.\nGSG DEI Acting Chair (since Fall 2025): Organized events like the successful Cuisine of the Month and prepared the relaunch of the GSG Buddy Program, engaging several hundreds of graduate students.\nPresident, Princeton Film Festival Society (since 2023): Curated and screened over 50 films, bringing in top filmmakers for Q&A sessions and masterclasses.\nFrench & Italian Department DEI Founding Member: Co-wrote the DEI statement, surveyed the community, and liaised between students and faculty.\n\nWhat will I do?\n\nReinstate a strong cooperation between GSG and the Graduate School’s Access, Diversity, and Inclusion office\nRelaunch the GSG Buddy Program, allowing G1s to connect with G2+ students and have mutually beneficial meetings\nSurvey the entire graduate student community and elevate their successes and concerns to the appropriate administrative offices.\nContinue and multiply events that promote diversity and inclusion",
          "headshot": "assets/headshots/dei-officer-yassine-ait-ali.png"
        },
        {
          "name": "Keshav Shukla",
          "statement": "My name is Keshav (he/him) and I’m a first-year grad student in the CBE department,\nrunning for the DEI officer position. I’m from Dallas and graduated from UCLA last year\nwith a Bachelor’s degree in Chemical Engineering. Growing up as a member of the LGBTQ+\ncommunity in India, at a time when being queer was a criminal offense, I struggled to\nconnect my Indian/Hindu and queer identities. Queerness was labeled “Western” in\ntraditional circles, while my cultural identity was slotted as regressive in queer spaces. In\ncollege, I founded ShaQTI (spelled “shakti”, Sanskrit for “power”), UCLA’s first and only\norganization that aimed to create an empowering affinity space for South Asian LGBTQ+\nmembers to find community and express their identities freely. From organizing themed\nevents, to liaising with DEI offices and student government on campus, to conducting\noutreach and advocacy for the needs of the community, serving as president of ShaQTI for\nthree years allowed me to give back to and strengthen communities that I once struggled to\nconnect with, and helped me understand the significance of intersectionality in creating\ndiverse and inclusive communities.\nAt Princeton, I have been an active member of the ADI team’s Graduate Scholars Program\n(GSP), which has introduced me to the various resources available on campus for personal\nand professional development as well as helped me find a strong community of diverse\nscholars as a first-generation graduate student. As the DEI officer for GSG, I would aim to set\nup accessible, biweekly/monthly affinity spaces for graduate students who are a part of the\nQTBIPOC, first-gen, international and other historically marginalized communities in\ngraduate education to foster connection and support regularly. I would also work to establish\na confidential reporting portal for graduate students to document experiences of racism,\nhomophobia, transphobia, or other forms of bias, allowing GSG to identify patterns and work\nwith appropriate offices to strengthen advocacy and take action. Additionally, I would help\nconduct regular climate and well-being surveys to better understand how graduate students\nfrom various backgrounds experience belonging and support on campus, and use them to\norganize events with CPS, ADI, and other campus organizations. I am confident that my\nprevious leadership experience at UCLA and commitment to serve the graduate student\ncommunity at Princeton would help me be successful as the DEI officer for GSG. I truly\nappreciate your support in this election!",
          "headshot": "assets/headshots/dei-officer-keshav-shukla.jpg"
        }
      ]
    }
  ]
}